{"Job1":{"title":"Van Driver Warehouse Assistant","document_filename":"van driver warehouse assistant.pdf","location":"Milton Keynes","hours":"36 hours per week on a rolling Monday to Sunday rota","salary":"£9.15 per hour","closing_date":"to be confirmed","interview_date":"to be confirmed","about_role":"We need a reliable person to join our friendly team in Kiln Farm.  This role will be a mixture of van driving and warehouse duties as required. You will help to replenish stock on the shopfloor, serve customers and answer queries.  You will also drive the furniture van, delivering furniture and household goods to customers and collecting donated goods from donors in Milton Keynes.  This is an essential role that ensures the smooth running of the Furniture Store which is open to members of the public and relies on donations of unwanted, good quality items from the local community.  Money raised by the Furniture Store plays a vital role in funding the services and support Age UK Milton Keynes provides to older people living in Milton Keynes.","about_you":"We are looking for someone who is able to move and handle heavy items.  You must have good customer service skills and be flexible and adaptable to change.  A clean driving licence and the ability to drive a 3.5 tonne van are essential."},"Job2":{"title":"Footcare Agent","document_filename":"freelance footcare agent jd.pdf","location":"Milton Keynes ","hours":"flexible with no specified limit","salary":"self employed with commission paid to Age UK Milton Keynes","closing_date":"open ended","interview_date":"to be arranged","about_role":"We are looking for qualified self-employed Footcare Health Practitioners to provide a toenail cutting service  for older people, and people with a physical or learning disability, in Milton Keynes.  The service maintains and improves people's wellbeing and quality of life by helping them manage their toenails safely and maintain their independence at home wherever possible.  The service is provided by a network of self-employed Freelance Footcare Agents.  Each agent will manage their own time and make their own appointments directly with the clients.  These vacancies are for all areas of Milton Keynes.  Own transport and telephone are essential.  Membership of an Accredited Register of FHPs, references and an enhanced DBS check will be required before starting work.","about_you":"You will have good interpersonal skills and be at ease working with people’s feet.  You must be able to organise your own workload and be honest, trustworthy and flexible.  We are looking for caring people who have an understanding of the issues that affect older clients and have empathy with people who are disabled, frail or from an ethnic minority background. "},"Job3":{"title":"Deep Clean Worker","document_filename":"Deep clean worker JD.pdf","location":"Milton Keynes","hours":"the number of hours is flexible with no specified limit or guaranteed minimum","salary":"£10.87 per hour with an enhanced rate of £11.50 for more intensive deep cleans.","closing_date":"open ended","interview_date":"Interviews will be held shortly thereafter","about_role":"The Deep Clean Service is intended for clients who need a more comprehensive cleaning service than that provided by our Independent Living Service.  This is often necessary because the client has not been able to maintain the housework for long periods, so their home requires a team of staff to bring the home up to a safe and hygienic standard.  As part of the team you will be involved in all work needed to make the home clean again.  You will cover all areas of Milton Keynes, with part-time flexible working hours. ","about_you":"A willingness to carry out often difficult and unpleasant cleaning tasks is essential.  You must have empathy for older people and be able to treat our clients and their homes with respect at all times. Training and support will be provided.  A car and telephone are essential."},"Job4":{"title":"Relief Hospital Aftercare Assistant","document_filename":"Hospital Aftercare Assistant 0 hours.pdf","location":"Milton Keynes","hours":"Work will be on a flexible rota system, you will be on call to cover the service Monday to Saturday covering either an 8.00-2.00pm shift or 2.00-8.00pm","salary":"£10.22 per hour","closing_date":"ongoing","interview_date":"to be arranged","about_role":"We are looking for caring individuals to work on our Hospital Aftercare service to provide essential winter support. The role will include transporting patients home from hospital and enabling them to stay in their homes by providing practical support such as light housework and shopping. Own transport is essential as you will work in all areas and surrounding villages of Milton Keynes. Flexible hours available.","about_you":"Successful applicants will have a caring nature and an understanding of the issues that affect older people.  You will need to be a good listener and have empathy with older people, as well as enjoy doing light housework, shopping tasks and general duties that help and support older people.  A car and telephone are essential."},"Job5":{"title":"Part time Store Supervisor","document_filename":"supervisor dec 21.pdf","location":"Milton Keynes","hours":"16 hours a week to include weekends","salary":"£9.20 per hour","closing_date":"","interview_date":"","about_role":"The role of the Supervisor is to open and close the Home & Furniture store, to ensure all daily compliance checks are done and till is cashed up at the end of the day in the absence of the Manager and Assistant Manager. Mainly weekend work.","about_you":"We are looking for someone with absolute integrity, with experience in a managerial or supervisory role in a customer facing role in a retail or warehouse environment."},"Job6":{"title":"Home & Furniture Store Manager","document_filename":"home furniture store manager dec 21.pdf","location":"Milton Keynes","hours":"36 hours a week to include some weekend working","salary":"£25,000 per annum","closing_date":"","interview_date":"","about_role":"As the Home & Furniture Store Manager, you will have overall control of our flagship store, with focus is on sales and delivery of budgeted profit, exceptional customer service and consistent operational excellence, supporting and leading the running of the Home & Furniture Store and Online Shop to drive footfall and sales. Your aim is to ensure retail’s profit contribution to Age UK Milton Keynes is sufficient to maintain and develop extra services for those that need us.","about_you":""},"Job7":{"title":"High Street Shops Manager ","document_filename":"high street shops manager dec 21.pdf","location":"Milton Keynes","hours":"36 Hours with some weekend working","salary":"£25,000","closing_date":"","interview_date":"","about_role":"This role requires the perfect blend of commercial and practical knowledge. Overseeing the day to day running of the Age UK Milton Keynes 8 high street shops and being responsible for the shop managers and assistant managers. To succeed in this role, you will require the skills to be able to lead and motivate your teams to deliver results. You will be responsible for taking the retail strategy and making it work in the shops, ensuring they hit their targets and that the teams continue to grow and develop. You need to show leadership and will be required to step in if one of the Shop Managers is struggling and spend time coaching them on how to lead a successful shop; this takes a love of hands-on hard work and a practical approach.","about_you":""},"Job9":{"title":"Assistant Potato Human","document_filename":"Assistant Potato Human.pdf","location":"Everywhere","hours":"1 hour","salary":"Billion","closing_date":"7th of the 12th","interview_date":"Now","about_role":"Whispering to Potatoes. Make sure they are okay. Must have previous Potato experience.","about_you":"Nice. Good with Potatoes."}}
